Repository: NaN-tic/trytond-csv_import
Catalog: locale/*.po
Languages: ca_es, es_es

# error:csv.archive:
source: Archive %s/csv/%s not found.
ca_es: Arxiu %s/csv/%s no trobat.
es_es: Archivo %s/csv/%s no encontrado.

# error:csv.archive:
source: CSV Import Error!
ca_es: Error a la importació CSV!
es_es: ¡Error en la importación CSV!

# error:csv.archive:
source: CSV improperly formatted.
ca_es: CSV formatat incorrectament.
es_es: CSV formateado incorrectamente.

# error:csv.archive:
source: Code not found: Line: %s.
ca_es: Codi no trobat: Línia %s.
es_es: Código no encontrado: Línea %s.

# error:csv.archive:
source: Error creating %s.
ca_es: Error creant %s.
es_es: Error creando %s.

# error:csv.archive:
source: Error creating record with values %s. Error raised: %s.
ca_es: Error creant registre amb valors %s. Error aixecat %s.
es_es: Error creando el registro con valores %s. Error elevado: %s.

# error:csv.archive:
source: Error in mapping template: %s.
ca_es: Error a l'assignació de plantilla: %s.
es_es: Error en la asignación de la plantilla: %s.

# error:csv.archive:
source: Error reading file %s.
ca_es: Error llegint l'arxiu %s.
es_es: Error leyendo el archivo %s.

# error:csv.archive:
source: Error reading file: %s. Error %s.
ca_es: Error llegint l'arxiu %s. Error %s.
es_es: Error leyendo el archivo %s.

# error:csv.archive:
source: Error saving file! %s.
ca_es: Error guardant l'arxiu! %s.
es_es: Error guardando el archivo %s.

# error:csv.archive:
source: Error updating %s of model %s! Parent not found.
ca_es: Error actualitzant %s del model %s! Pare no trobat.
es_es: ¡Error actualizando %s del modelo %s! Padre no encontrado.

# error:csv.archive:
source: Function in CSV Profile has a mistake. Please, review: %s. See logs for more information.
ca_es: La funció al perfil CSV té un error. Si us plau, reviseu: %s. Mireu el registre per a més informació.
es_es: La función en el perfil CSV tiene un error.

# error:csv.archive:
source: Import CSV file.
es_es: Importar fichero CSV.

# error:csv.archive:
source: Import CSV notification from %s.
ca_es: Notificació de importació CSV des de %s.
es_es: Notificación de importación CSV desde %s.

# error:csv.archive:
source: Information.
ca_es: Informació.
es_es: Información.

# error:csv.archive:
source: No csv archive found. Please, select one.
ca_es: No s'ha trobat cap arxiu csv.
es_es: Archivo csv no encontrado. Por favor, seleccione uno.

# error:csv.archive:
source: Reading %s archive.
ca_es: Llegint arxiu %s.
es_es: Leyendo %s archivo.

# error:csv.archive:
source: Record %s already exist.
ca_es: Registre %s ja existeix.
es_es: El registro %s ya existe.

# error:csv.archive:
source: Record %s created successfully!
ca_es: Registre %s creat amb èxit!
es_es: ¡Se ha creado con éxito el registro %s!

# error:csv.archive:
source: Record %s of %s, updated with values %s!
ca_es: Registre %s de %s, actualitzat amb els valors %s!
es_es: ¡Registro %s de %s, actualizado con los valores %s!

# error:csv.archive:
source: Simulation successfully. Record %s not created nor updated.
ca_es: Simulació finalitzada amb èxit.
es_es: Simulación finalizada con éxito.

# error:csv.archive:
source: There are new %s from %s. IDs:
ca_es: Hi han nous %s des de %s: IDs:
es_es: Hay nuevos %s desde %s. IDs:

# error:csv.archive:
source: There is no default email configured. Please, configure one.
es_es: No hay ningún correo electrónico por defecto. Deberá configurar un correo electrónico.

# error:csv.archive:
source: Unable to update %s because record %s not found. In order to allow updating, please uncheck "Exclude update" field in the Base External Mapping profile, or add more data in csv file to find this record.
ca_es: No s'ha pogut actualitzar %s perquè no s'ha trobat el registre %s.
es_es: No se ha podido actualizar %s porque no se ha encontrado el registro %s.

# field:base.external.mapping,parent:
source: Parent Model
ca_es: Model pare
es_es: Modelo padre

# field:base.external.mapping,profile:
source: CSV Profile
ca_es: Perfil CSV
es_es: Perfil CSV

# field:base.external.mapping,rel_field:
source: Related Field
ca_es: Camp relacionat
es_es: Campo relacionado

# field:base.external.mapping,required:
source: Required
ca_es: Requerit
es_es: Requerido

# field:csv.archive,archive_name:
source: Archive Name
ca_es: Nom de l'artxiu
es_es: Nombre del archivo

# field:csv.archive,create_date:
source: Create Date
ca_es: Data de creació
es_es: Fecha de creación

# field:csv.archive,create_uid:
source: Create User
ca_es: Usuari de creació
es_es: Usuario de creación

# field:csv.archive,data:
source: Archive
ca_es: Arxiu
es_es: Archivo

# field:csv.archive,date_archive:
source: Date
ca_es: Data
es_es: Fecha

# field:csv.archive,profile:
source: CSV Profile
ca_es: Perfil CSV
es_es: Perfil CSV

# field:csv.archive,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:csv.archive,state:
source: State
ca_es: Estat
es_es: Estado

# field:csv.archive,write_date:
source: Write Date
ca_es: Data de modificació
es_es: Fecha modificación

# field:csv.archive,write_uid:
source: Write User
ca_es: Usuari de modificació
es_es: Usuario modificación

# field:csv.import,archive:
source: Archive
ca_es: Arxiu
es_es: Archivo

# field:csv.import,comment:
source: Comment
ca_es: Comentari
es_es: Comentario

# field:csv.import,create_date:
source: Create Date
ca_es: Crea
es_es: Crear

# field:csv.import,create_uid:
source: Create User
ca_es: Usuari de creació
es_es: Usuario de creación

# field:csv.import,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:csv.import,record:
source: Imported Record
ca_es: Registre importat
es_es: Registro importado

# field:csv.import,status:
source: Status
ca_es: Estat
es_es: Estado

# field:csv.import,write_date:
source: Write Date
ca_es: Data de modificació
es_es: Fecha modificación

# field:csv.import,write_uid:
source: Write User
ca_es: Usuari de modificació
es_es: Usuario modificación

# field:csv.profile,active:
source: Active
ca_es: Arxiu
es_es: Activo

# field:csv.profile,archives:
source: Archives
ca_es: Arxius
es_es: Archivos

# field:csv.profile,code_external:
source: CSV Code Field
ca_es: Camp codi CSV
es_es: Campo código CSV

# field:csv.profile,code_internal:
source: Tryton Code Field
ca_es: Camp codi Tryton
es_es: Campo código de Tryton

# field:csv.profile,create_date:
source: Create Date
ca_es: Data de creació
es_es: Fecha de creación

# field:csv.profile,create_record:
source: Create
ca_es: Crea
es_es: Crear

# field:csv.profile,create_uid:
source: Create User
ca_es: Usuari de creació
es_es: Usuario de creación

# field:csv.profile,csv_archive_separator:
source: CSV Separator
ca_es: Separador CSV
es_es: Separador CSV

# field:csv.profile,csv_header:
source: Header
ca_es: Capçalera
es_es: Encabezado

# field:csv.profile,csv_quote:
source: Quote
ca_es: Delimitador
es_es: Presupuesto

# field:csv.profile,group:
source: Group
ca_es: Grup
es_es: Grupo

# field:csv.profile,language:
source: Language Default
ca_es: Idioma per defecte
es_es: Idioma por defecto

# field:csv.profile,models:
source: Model
es_es: Modelo

# field:csv.profile,note:
source: Notes
es_es: Notas

# field:csv.profile,party:
source: Party
ca_es: Tercer
es_es: Terceros

# field:csv.profile,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:csv.profile,update_record:
source: Update
ca_es: Actualitza
es_es: Actualizar

# field:csv.profile,write_date:
source: Write Date
ca_es: Data de modificació
es_es: Fecha modificación

# field:csv.profile,write_uid:
source: Write User
ca_es: Usuari de modificació
es_es: Usuario modificación

# help:base.external.mapping,required:
source: Avoid blank rows in csv file. If not, the previous row is given.
ca_es: Impideix registres en blanc al arxiu. Si no, s'agara el de la fila anterior.
es_es: Impide registros en blanco en el fichero csv. Si no, se toman los valores de la fila anterior.

# help:csv.profile,code_external:
source: Code field in CSV column.
ca_es: Camp codi a la columna CSV.
es_es: Campo código en columna CSV.

# help:csv.profile,code_internal:
source: Code field in Tryton.
ca_es: Camp codi a Tryton.
es_es: Campo código en Tryton.

# help:csv.profile,create_record:
source: Create record from CSV
ca_es: Registre creat des de CSV
es_es: Crear registro desde CSV.

# help:csv.profile,csv_archive_separator:
source: Product archive CSV Separator
ca_es: Separador CSV d'arxiu de producte.
es_es: Separador CSV en el archivo de producto.

# help:csv.profile,csv_header:
source: Header (field names) on archives
ca_es: Capçalera (noms de camps) a l'arxiu
es_es: Cabecera (nombres de campo) en los archivos.

# help:csv.profile,csv_quote:
source: Character to use as quote
ca_es: Caràcter utilitzat com a delimitador.
es_es: Carácter a usar como delimitador.

# help:csv.profile,group:
source: Group Users to notification
ca_es: Grup d'usuaris per notificacions
es_es: Grupo de usuarios para notificaciones.

# help:csv.profile,language:
source: Default language
ca_es: Idioma per defecte
es_es: Idioma por defecto

# help:csv.profile,party:
source: Party CSV Profile.
ca_es: Perfil CSV de tercer.
es_es: Perfil CSV de tercero.

# help:csv.profile,update_record:
source: Update record from CSV
ca_es: Actualitza registre des de CSV
es_es: Actualizado registro desde CSV.

# model:csv.archive,name:
source: CSV Archive
ca_es: Arxiu CSV
es_es: Archivo CSV

# model:csv.import,name:
source: CSV Import
ca_es: Importacions CSV
es_es: Importaciones CSV

# model:csv.profile,name:
source: CSV Profile
ca_es: Perfil CSV
es_es: Perfil CSV

# model:ir.action,name:act_csv_archive
source: CSV Archive
ca_es: Arxiu CSV
es_es: Archivo CSV

# model:ir.action,name:act_csv_archive_shortcut
source: CSV Archives
ca_es: Arxius CSV
es_es: Archivos CSV

# model:ir.action,name:act_csv_import
source: CSV Import
ca_es: Importacions CSV
es_es: Importaciones CSV

# model:ir.action,name:act_csv_import_with_domain
source: CSV Import
ca_es: Importacions CSV
es_es: Importaciones CSV

# model:ir.action,name:act_csv_profile
source: CSV Profile
ca_es: Perfil CSV
es_es: Perfil CSV

# model:ir.ui.menu,name:menu_csv_archive
source: CSV Archive
ca_es: Arxiu CSV
es_es: Archivo CSV

# model:ir.ui.menu,name:menu_csv_import
source: CSV Import
ca_es: Importacions CSV
es_es: Importaciones CSV

# model:ir.ui.menu,name:menu_csv_profile
source: CSV Profile
ca_es: Perfil CSV
es_es: Perfil CSV

# model:res.group,name:group_csv_import_admin
source: CSV Import Administrator
ca_es: Administrador importacions CSV
es_es: Administrador CSV Importación

# selection:csv.archive,state:
source: Canceled
ca_es: Cancel·lat
es_es: Cancelado

# selection:csv.archive,state:
source: Done
ca_es: Fet
es_es: Realizado

# selection:csv.archive,state:
source: Draft
ca_es: Esborrany
es_es: Borrador

# selection:csv.import,status:
source: Done
ca_es: Fet
es_es: Realizado

# selection:csv.profile,csv_archive_separator:
source: Comma
ca_es: Coma
es_es: Coma

# selection:csv.profile,csv_archive_separator:
source: Semicolon
ca_es: Punt i coma
es_es: Punto y coma

# selection:csv.profile,csv_archive_separator:
source: Tabulator
ca_es: Tabulador
es_es: Tabulador

# view:csv.archive:
source: CSV Archive
ca_es: Arxiu CSV
es_es: Archivo CSV

# view:csv.archive:
source: Cancel Import Data from CSV
ca_es: Cancel·la la importació de dades desde CSV
es_es: Cancelar la importación de datos desde CSV

# view:csv.archive:
source: Draft
ca_es: Esborrany
es_es: Borrador

# view:csv.archive:
source: Import Data from CSV
ca_es: Importa dades des de CSV
es_es: Importar datos desde CSV

# view:csv.import:
source: CSV Import
ca_es: Importacions CSV
es_es: Importaciones CSV

# view:csv.profile:
source: CSV Import
ca_es: Importa CSV
es_es: Importar CSV

# view:csv.profile:
source: CSV Profiles
ca_es: Perfils CSV
es_es: Perfiles CSV

# view:csv.profile:
source: Configuration
ca_es: Configuració
es_es: Configuración

# view:csv.profile:
source: Notes
es_es: Notas
